000010*>
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.   KinBank.
000040 ENVIRONMENT    DIVISION.
000050 CONFIGURATION  SECTION.
000060 DATA DIVISION.
000070 WORKING-STORAGE SECTION.
000080 PROCEDURE DIVISION.
000090     
000100 END PROGRAM KinBank.
