000010*>
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.   KinBank.
000040 ENVIRONMENT    DIVISION.
000050 INPUT-OUTPUT SECTION.
000051 FILE-CONTROL.
000052     SELECT ACCOUNT-FILE
000053         ASSIGN TO "AccountFile.dat"
000054         ORGANIZATION IS LINE SEQUENTIAL.
000060 DATA DIVISION.
000061 FILE SECTION.
000062 FD ACCOUNT-FILE.
000063 01 ACCOUNT-RECORD.
000064     05 ACC-NO PIC 9(13).
000065     05 ACC-ID PIC 9(10) VALUE ZERO.
000066     05 ACC-NAME PIC X(20).
000067     05 ACC-PASSWORD PIC X(12).
000068     05 ACC-BALANCE PIC 9(12)V99.
000070 WORKING-STORAGE SECTION.
000071 01 IMPORT-DATA-ACCOUNT
000072     05 IDA-NO PIC 9(13).
000073     05 IDA-ID PIC 9(10) VALUE ZERO.
000074     05 IDA-NAME PIC X(20).
000075     05 IDA-PASSWORD PIC X(12).
000076     05 IDA-BALANCE PIC 9(12)V99.
000080 PROCEDURE DIVISION.
000081 KINBANK-PROGRAM-BEGIN.
000082 
000083 
000084 KINBANK-PROGRAM-END.
000085     DISPLAY "==============================".
000086     DISPLAY "KET THUC CHUONG TRINH !!!".
000087     DISPLAY "==============================".
000088     STOP RUN.
000089 KINBANK-PROGRAM-LOGIN.
000090     DISPLAY "==============================".
000091     DISPLAY "============LOGIN=============".
000092     DISPLAY "==============================".
000093     
000094     
000095 KINBANK-PROGRAM-MENU.
000096     DISPLAY "==============================".
000097     DISPLAY "=============MENU=============".
000098     DISPLAY "==============================".
000099     
000100     
000110 END PROGRAM KinBank.