000010*>
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.   KinBank.
000040 ENVIRONMENT    DIVISION.
000050 INPUT-OUTPUT SECTION.
000051 FILE-CONTROL.
000052     SELECT ACCOUNT-FILE
000053         ASSIGN TO "AccountFile.dat"
000054         ORGANIZATION IS LINE SEQUENTIAL.
000060 DATA DIVISION.
000061 FILE SECTION.
000062 FD ACCOUNT-FILE.
000063 01 ACCOUNT-RECORD.
000064     05 ACC-NO PIC 9(13).
000065     05 ACC-ID PIC X(10).
000066     05 ACC-NAME PIC X(20).
000067     05 ACC-PASSWORD PIC X(12).
000068     05 ACC-BALANCE PIC 9(12)V99.
000070 WORKING-STORAGE SECTION.
000071 01 IMPORT-DATA-ACCOUNT
000072     05 IDA-NO PIC 9(13).
000073     05 IDA-ID PIC X(10).
000074     05 IDA-NAME PIC X(20).
000075     05 IDA-PASSWORD PIC X(12).
000076     05 IDA-BALANCE PIC 9(12)V99.
000077 01 MENU-LOGIN PIC 9 VALUE ZERO.
000080 PROCEDURE DIVISION.
000081 KINBANK-PROGRAM-BEGIN.
000082 
000083 
000084 KINBANK-PROGRAM-END.
000085     DISPLAY "==============================".
000086     DISPLAY "KET THUC CHUONG TRINH !!!".
000087     DISPLAY "==============================".
000088     STOP RUN.
000089 KINBANK-PROGRAM-MENU-LOGIN.
000090     DISPLAY "==============================".
000091     DISPLAY "==========MENU LOGIN==========".
000092     DISPLAY "==============================".
000093     DISPLAY "1 - DANG NHAP".
000094     DISPLAY "2 - TAO TAI KHOAN".
000095     DISPLAY "3 - THOAT".
000096     ACCEPT MENU-LOGIN.
000097     
000098     
000099 KINBANK-LOGIN.
000100 
000101 KINBANK-REGISTER.
000102     DISPLAY "==============================".
000103     DISPLAY "===========REGISTER===========".
000104     DISPLAY "==============================".
000105     DISPLAY "TEN TAI KHOAN".
000106     ACCEPT IDA-NAME.
000107     DISPLAY "MA DINH DANH TAI KHOAN".
000108     ACCEPT IDA-ID.
000109     DISPLAY "MAT KHAU TAI KHOAN".
000110     ACCEPT IDA-PASSWORD.
000111     DISPLAY "MAT KHAU TAI KHOAN".
000112     ACCEPT IDA-PASSWORD.
000113     
000114     MOVE 0 TO ACC-BALANCE.
000115     MOVE IDA-NAME TO ACC-NAME.
000116     MOVE IDA-ID TO ACC-ID.
000117     MOVE IDA-PASSWORD TO ACC-PASSWORD.
000118     
000119     WRITE ACCOUNT-RECORD
000122     
000123 KINBANK-PROGRAM-MENU.
000124     DISPLAY "==============================".
000125     DISPLAY "=============MENU=============".
000126     DISPLAY "==============================".
000127     
000128     
000130 END PROGRAM KinBank.